OdDAI.NamedType.setName(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Sets a name for the named data type.
\param name [in] An ANSI string that contains the name to be set.

OdDAI.NamedType.type(OdSharedPtr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the type code for the named type.
\param typeCode [in] A smart pointer to the type code object to be set.